# Программа вычисления арифметического выражения заданного строкой 4 основные операции

str1 = input('Введите арифметическое выражение: ')
list1 = []
k = -1


for j in len(str1):
    for i, char in enumerate(str1):
        if char == '+' or char == '-' or char == '*' or char == '/':


print(list1)
